# Brewfile
# ===== Formulae (explicit) =====
brew "awscli"
brew "htop"
brew "node"
brew "postgresql@14"
brew "pyenv"
brew "python@3.13"
brew "starship"
brew "terraform"
brew "z"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# ===== Casks =====
cask "chatgpt"
cask "docker-desktop"
cask "iterm2"
cask "corretto@21"
cask "font-jetbrains-mono-nerd-font"
cask "clipy"
cask "rectangle"
cask "scroll-reverser"
